JsonJiu/WX/昆仑/Codes/bsp/CBB_MCU_019_ForICCard/ior5f10wle.h
#define IICRSV0           IICF0_bit.no0
#define STCEN0            IICF0_bit.no1
#define IICBSY0           IICF0_bit.no6
#define STCF0             IICF0_bit.no7

#define RCLOE1            RTCC0_bit.no5
#define RCLOSEL           RTCC0_bit.no6
#define RTCE              RTCC0_bit.no7

#define RWAIT             RTCC1_bit.no0
#define RWST              RTCC1_bit.no1
#define RIFG              RTCC1_bit.no3
#define WAFG              RTCC1_bit.no4
#define RITE              RTCC1_bit.no5
#define WALIE             RTCC1_bit.no6
#define WALE              RTCC1_bit.no7

#define HIOSTOP           CSC_bit.no0
#define XTSTOP            CSC_bit.no6
#define MSTOP             CSC_bit.no7

#define SDIV              CKC_bit.no3
#define MCM0              CKC_bit.no4
#define MCS               CKC_bit.no5
#define CSS               CKC_bit.no6
#define CLS               CKC_bit.no7

#define PCLOE0            CKS0_bit.no7

#define PCLOE1            CKS1_bit.no7

#define LVIF              LVIM_bit.no0
#define LVIOMSK           LVIM_bit.no1
#define LVISEN            LVIM_bit.no7

#define LVILV             LVIS_bit.no0
#define LVIMD             LVIS_bit.no7

#define DWAIT0            DMC0_bit.no4
#define DS0               DMC0_bit.no5
#define DRS0              DMC0_bit.no6
#define STG0              DMC0_bit.no7

#define DWAIT1            DMC1_bit.no4
#define DS1               DMC1_bit.no5
#define DRS1              DMC1_bit.no6
#define STG1              DMC1_bit.no7

#define DST0              DRC0_bit.no0
#define DEN0              DRC0_bit.no7

#define DST1              DRC1_bit.no0
#define DEN1              DRC1_bit.no7

#define TKBIF20           IF2L_bit.no0
#define TMIF04            IF2L_bit.no1
#define TMIF05            IF2L_bit.no2
#define PIF6              IF2L_bit.no3
#define PIF7              IF2L_bit.no4
#define LCDIF0            IF2L_bit.no5
#define CMPIF0            IF2L_bit.no6
#define CMPIF1            IF2L_bit.no7

#define TMIF06            IF2H_bit.no0
#define TMIF07            IF2H_bit.no1
#define MDIF              IF2H_bit.no5
#define FLIF              IF2H_bit.no7

#define DMAIF2            IF3L_bit.no0
#define DMAIF3            IF3L_bit.no1

#define TKBMK20           MK2L_bit.no0
#define TMMK04            MK2L_bit.no1
#define TMMK05            MK2L_bit.no2
#define PMK6              MK2L_bit.no3
#define PMK7              MK2L_bit.no4
#define LCDMK0            MK2L_bit.no5
#define CMPMK0            MK2L_bit.no6
#define CMPMK1            MK2L_bit.no7

#define TMMK06            MK2H_bit.no0
#define TMMK07            MK2H_bit.no1
#define MDMK              MK2H_bit.no5
#define FLMK              MK2H_bit.no7

#define DMAMK2            MK3L_bit.no0
#define DMAMK3            MK3L_bit.no1

#define TKBPR020          PR02L_bit.no0
#define TMPR004           PR02L_bit.no1
#define TMPR005           PR02L_bit.no2
#define PPR06             PR02L_bit.no3
#define PPR07             PR02L_bit.no4
#define LCDPR00           PR02L_bit.no5
#define CMPPR00           PR02L_bit.no6
#define CMPPR01           PR02L_bit.no7

#define TMPR006           PR02H_bit.no0
#define TMPR007           PR02H_bit.no1
#define MDPR0             PR02H_bit.no5
#define FLPR0             PR02H_bit.no7

#define DMAPR02           PR03L_bit.no0
#define DMAPR03           PR03L_bit.no1

#define TKBPR120          PR12L_bit.no0
#define TMPR104           PR12L_bit.no1
#define TMPR105           PR12L_bit.no2
#define PPR16             PR12L_bit.no3
#define PPR17             PR12L_bit.no4
#define LCDPR10           PR12L_bit.no5
#define CMPPR10           PR12L_bit.no6
#define CMPPR11           PR12L_bit.no7

#define TMPR106           PR12H_bit.no0
#define TMPR107           PR12H_bit.no1
#define MDPR1             PR12H_bit.no5
#define FLPR1             PR12H_bit.no7

#define DMAPR12           PR13L_bit.no0
#define DMAPR13           PR13L_bit.no1

#define WDTIIF            IF0L_bit.no0
#define LVIIF             IF0L_bit.no1
#define PIF0              IF0L_bit.no2
#define PIF1              IF0L_bit.no3
#define PIF2              IF0L_bit.no4
#define PIF3              IF0L_bit.no5
#define PIF4              IF0L_bit.no6
#define PIF5              IF0L_bit.no7

#define STIF2             IF0H_bit.no0
#define SRIF2             IF0H_bit.no1
#define SREIF2            IF0H_bit.no2
#define DMAIF0            IF0H_bit.no3
#define DMAIF1            IF0H_bit.no4
#define CSIIF00           IF0H_bit.no5
#define IICIF00           IF0H_bit.no5
#define STIF0             IF0H_bit.no5
#define TMIF00            IF0H_bit.no6
#define SRIF0             IF0H_bit.no7

#define SREIF0            IF1L_bit.no0
#define TMIF01H           IF1L_bit.no0
#define CSIIF10           IF1L_bit.no1
#define IICIF10           IF1L_bit.no1
#define STIF1             IF1L_bit.no1
#define SRIF1             IF1L_bit.no2
#define SREIF1            IF1L_bit.no3
#define TMIF03H           IF1L_bit.no3
#define IICAIF0           IF1L_bit.no4
#define RTITIF            IF1L_bit.no5
#define TMIF01            IF1L_bit.no7

#define TMIF02            IF1H_bit.no0
#define TMIF03            IF1H_bit.no1
#define ADIF              IF1H_bit.no2
#define RTCIF             IF1H_bit.no3
#define TMKAIF            IF1H_bit.no4
#define KRIF              IF1H_bit.no5

#define WDTIMK            MK0L_bit.no0
#define LVIMK             MK0L_bit.no1
#define PMK0              MK0L_bit.no2
#define PMK1              MK0L_bit.no3
#define PMK2              MK0L_bit.no4
#define PMK3              MK0L_bit.no5
#define PMK4              MK0L_bit.no6
#define PMK5              MK0L_bit.no7

#define STMK2             MK0H_bit.no0
#define SRMK2             MK0H_bit.no1
#define SREMK2            MK0H_bit.no2
#define DMAMK0            MK0H_bit.no3
#define DMAMK1            MK0H_bit.no4
#define CSIMK00           MK0H_bit.no5
#define IICMK00           MK0H_bit.no5
#define STMK0             MK0H_bit.no5
#define TMMK00            MK0H_bit.no6
#define SRMK0             MK0H_bit.no7

#define SREMK0            MK1L_bit.no0
#define TMMK01H           MK1L_bit.no0
#define CSIMK10           MK1L_bit.no1
#define IICMK10           MK1L_bit.no1
#define STMK1             MK1L_bit.no1
#define SRMK1             MK1L_bit.no2
#define SREMK1            MK1L_bit.no3
#define TMMK03H           MK1L_bit.no3
#define IICAMK0           MK1L_bit.no4
#define RTITMK            MK1L_bit.no5
#define TMMK01            MK1L_bit.no7

#define TMMK02            MK1H_bit.no0
#define TMMK03            MK1H_bit.no1
#define ADMK              MK1H_bit.no2
#define RTCMK             MK1H_bit.no3
#define TMKAMK            MK1H_bit.no4
#define KRMK              MK1H_bit.no5

#define WDTIPR0           PR00L_bit.no0
#define LVIPR0            PR00L_bit.no1
#define PPR00             PR00L_bit.no2
#define PPR01             PR00L_bit.no3
#define PPR02             PR00L_bit.no4
#define PPR03             PR00L_bit.no5
#define PPR04             PR00L_bit.no6
#define PPR05             PR00L_bit.no7

#define STPR02            PR00H_bit.no0
#define SRPR02            PR00H_bit.no1
#define SREPR02           PR00H_bit.no2
#define DMAPR00           PR00H_bit.no3
#define DMAPR01           PR00H_bit.no4
#define CSIPR000          PR00H_bit.no5
#define IICPR000          PR00H_bit.no5
#define STPR00            PR00H_bit.no5
#define TMPR000           PR00H_bit.no6
#define SRPR00            PR00H_bit.no7

#define SREPR00           PR01L_bit.no0
#define TMPR001H          PR01L_bit.no0
#define CSIPR010          PR01L_bit.no1
#define IICPR010          PR01L_bit.no1
#define STPR01            PR01L_bit.no1
#define SRPR01            PR01L_bit.no2
#define SREPR01           PR01L_bit.no3
#define TMPR003H          PR01L_bit.no3
#define IICAPR00          PR01L_bit.no4
#define RTITPR0           PR01L_bit.no5
#define TMPR001           PR01L_bit.no7

